#!/usr/bin/env bash
# ======================================================
# DanixOS :: Banner
# ======================================================
# DANIX_DESC: Displays the DanixOS banner
# DANIX_MENU: false
# ======================================================

# Build Version
BUILD="$(cat /etc/danixos-build 2>/dev/null || echo unknown)"

# Menu Header
printf "\n"
printf "=============================================================\n"
cat << "EOF"

    ██████╗  █████╗ ███╗   ██╗██╗██╗  ██╗ ██████╗ ███████╗
    ██╔══██╗██╔══██╗████╗  ██║██║╚██╗██╔╝██╔═══██╗██╔════╝
    ██║  ██║███████║██╔██╗ ██║██║ ╚███╔╝ ██║   ██║███████╗
    ██║  ██║██╔══██║██║╚██╗██║██║ ██╔██╗ ██║   ██║╚════██║
    ██████╔╝██║  ██║██║ ╚████║██║██╔╝ ██╗╚██████╔╝███████║
    ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝╚═╝╚═╝  ╚═╝ ╚═════╝ ╚══════╝

                   Live Utility Environment

EOF
printf "=============================================================\n"
printf "Build Version: %s\n" "$BUILD"
printf "\n"

# Show quick hardware info
danix-system-summary

#
# vim: set syntax=bash
#
